#과일 갯수를 세어주는 계산기

fruit = ["사과", "바나나", "망고", "사과", "망고", "포도", "바나나", "사과", "망고", "포도", "코코넛", "망고", "오렌지", "오렌지", "사과", "바나나", "망고", "사과", "망고", "포도", "바나나", "사과", "망고", "포도", "코코넛", "망고", "오렌지", "오렌지", "사과", "바나나", "망고", "사과", "망고", "포도", "바나나", "사과", "망고", "포도", "코코넛", "망고", "오렌지", "오렌지", "사과", "바나나", "망고", "사과", "망고", "포도", "바나나", "사과", "망고", "포도", "코코넛", "망고", "오렌지", "오렌지", "사과", "바나나", "망고", "사과", "망고", "포도", "바나나", "사과", "망고", "포도", "코코넛", "망고", "오렌지", "오렌지", "사과", "바나나", "망고", "사과", "망고", "포도", "바나나", "사과", "망고", "포도", "코코넛", "망고", "오렌지", "오렌지"]

d = {} #딕셔너리 함수

for f in fruit:
  if f in d:
    d[f] = d[f] + 1
  else:
    d[f] = 1

print(d)